color,r,g,b = exports.oCore:getServerColor()
infobox = exports.oInfobox
core = exports.oCore
fontscript = exports.oFont

cams = {
	{2460.2736816406,-1656.0323486328,13.751700401306,2461.0708007813,-1656.6313476563,13.828187942505},
	{1310.6810302734,200.95050048828,20.434400558472,1310.3962402344,199.9945526123,20.363367080688},
	{1539.6245117188,-1368.5590820313,331.15240478516,1540.1125488281,-1367.7723388672,330.77453613281},

	--v2
	{-2542.4086914062,2283.2951660156,5.6628999710083,-2543.0856933594,2282.5639648438,5.578866481781},
	{-46.709499359131,-2.321799993515,3.8538999557495,-47.5061378479,-2.9249947071075,3.8148474693298},
	{97.686599731445,-263.25140380859,2.1426999568939,97.022552490234,-263.9990234375,2.1528556346893},
	{1630.0261230469,-2401.6723632812,14.180100440979,1630.3795166016,-2402.6076660156,14.168381690979},
	{715.34368896484,-1519.8863525391,3.3468000888824,715.86810302734,-1519.0349121094,3.3569560050964},
}


hatter_cams = {
	{1391.7084960938,-2285.0454101563,66.460800170898,1392.7003173828,-2285.0363769531,66.333801269531},
	{2032.1518554688,-1821.7591552734,66.727699279785,2031.6716308594,-1822.6124267578,66.524436950684},
	{2444.5373535156,-1404.7100830078,66.799797058105,2445.2778320313,-1404.0762939453,66.575927734375},
	{1346.9482421875,-955.51947021484,75.678100585938,1347.4848632813,-954.67755126953,75.621101379395},
}

loginElements = {
	{
		--type(ped,veh,obj),objId,posX,posY,posZ,rot,pluszcucc(veh: color, ped: animation),weapon
		{"ped",114,2467.8098144531, -1671.3227539063, 13.486798286438,0,{"CRACK", "crckidle1"}},
		{"ped",66,2472.4104003906, -1663.4017333984, 13.323778152466,49,{"GANGS", "leanIDLE"}},

		{"vehicle",405,2474.5847167969, -1663.5546875, 12.954588890076,135},

		{"ped",176,2467.2326660156, -1657.3435058594, 13.291786193848,222,{"GHANDS", "gsign5"}, weapon = {5, 1}},
		{"ped",173,2478.7019042969, -1687.5948486328, 13.5078125,23, weapon = {30, 5}},
		{"ped",175,2465.0966796875, -1661.7263183594, 13.299331665039,255,{"GHANDS", "gsign1"}, weapon = {22, 2}},
	},
	{
        {"ped",298,1307.5880126953, 188.49951171875, 20.4609375,31,{"GHANDS", "gsign5"}, weapon = {29, 4}},
        {"ped",294,1306.4246826172, 190.22204589844, 20.466976165771,215},

        {"vehicle",402,1296.7576904297, 188.0686340332, 20.089509963989,272,{230,0,0}},
        {"vehicle",505,1309.8172607422, 183.07606506348, 20.533016204834,326,{200,200,200}},

        {"ped",285,1316.1851806641, 183.02032470703, 20.401037216187,42, weapon = {31, 5}},
        {"ped",285,1282.0153808594, 164.25328063965, 20.431129455566,287, weapon = {31, 5}},
    },
  	{
        {"ped",165,1548.6427001953, -1363.7427978516, 326.21829223633,179, weapon = {25, 2}},
        {"ped",147,1548.6665039063, -1364.4704589844, 326.2109375,0,{"GHANDS", "gsign4"}},
        {"ped",166,1546.0150146484, -1363.4184570313, 329.45703125,2, weapon = {34, 6}},
        {"ped",165,1560.7973632813, -1347.1877441406, 329.4609375,121, weapon = {34, 6}},

		{"vehicle",417,1548.6943359375, -1352.9757080078, 330.20556640625,270},
    },

	--v2
	{
		{"vehicle",546,-2551.0876464844,2282.28515625,4.8359375, 231, {255, 255, 255}},
		{"ped",101,-2549.1462402344,2279.9245117188,4.8359375, 231,{"GANGS", "leanIDLE"}},
		{"ped",91,-2552.3876953125,2266.5915527344,5.4755249023438,4,{"on_lookers", "wave_loop"}},
	},

	{
		{"vehicle", 532,-68.742362976074,-10.794208526611,3.1171875, 342, {112, 201, 77}},
		{"ped",200,-65.062309265137,-9.514835357666,3.1171875, 255,{"GANGS", "leanIDLE"}},
		{"vehicle", 531,-57.472087860107,-20.032064437866,3.1171875, 292, {227, 164, 54}},
		{"ped", 158,-57.472087860107,-20.032064437866,3.1171875, 292, warpToVeh = 3},
	},

	{
		{"vehicle", 609, 91.430320739746,-286.81265258789,1.578125, 0, {54, 158, 227}},
		{"vehicle", 530, 83.30110168457,-270.65670776367,1.578125, 221, {227, 103, 54}},
		{"vehicle", 530, 91.971115112305,-296.45916748047,1.578125, 24, {227, 54, 54}},
		{"ped", 260,91.971115112305,-296.45916748047,1.578125, 292, warpToVeh = 3},
		{"ped", 260,83.30110168457,-270.65670776367,1.578125, 292, warpToVeh = 2},
	},

	{
		{"vehicle", 577, 1655.7017822266,-2445.26953125,13.5546875, 0, {255, 255, 255}},
		{"vehicle", 485, 1632.5498046875,-2425.8679199219,13.5546875, 238, {255, 255, 255}},
		{"vehicle", 606, 1629.3408203125,-2419.0349121094,13.5546875, 200, {255, 255, 255}},
		{"ped", 16,630.0498046875,-2425.8679199219,13.5546875, 292, warpToVeh = 2},
	},

	{
		{"vehicle", 454, 733.74267578125,-1503.9763183594,1.55000001192093, 180, {224, 157, 81}},
		{"ped",19,724.02777099609,-1495.8050537109,1.9343447685242, 221,{"on_lookers", "wave_loop"}},
		{"ped",37,721.24682617188,-1479.3402099609,5.46875, 83,{"GHANDS", "gsign4"}},
		{"ped",45,720.18182373047,-1479.3640136719,5.46875, 267,{"GHANDS", "gsign4"}},
	}
}

musics = {
	{"good4u", "Olivia Rodrigo - Good 4 U"},
	{"lipaphy", "Dua Lipa - Physical"},
	{"lilmontero", "Lil Nas X - MONTERO"},
	{"rampap", "Minelli - Rampampam"},
	{"lovetonight", "Shouse - Love Tonight"},
	{"astronaut", "Masked Wolf - Astronaut in the Ocean"},
}

skins = {
	[2] = {2,7,11,13,14,15,20,21,22,23,24,26,27,28,29,30,31,32,33,34,35,36,37,46,72,100,101}, --ferfi 
	[1] = {10,12,17,18,19,25,38,40,41,55,56,69,76,91,93,131,150,151,169}, --noi
}

tiltottgombok = {
	["backspace"] = true,
	["tab"] = true,
	["-"] = true,
	["."] = true,
	[","] = true,
	["lctrl"] = true,
	["rctrl"] = true,
	["lalt"] = true,
	["mouse1"] = true,
	["mouse2"] = true,
	["mouse3"] = true,
	["F1"] = true,
	["F2"] = true,
	["F3"] = true,
	["F4"] = true,
	["F5"] = true,
	["F6"] = true,
	["F7"] = true,
	["F8"] = true,
	["F9"] = true,
	["F10"] = true,
	["F11"] = true,
	["F12"] = true,
	["lshift"] = true, 
	["rshift"] = true,
	["space"] = true,
	["pgdn"] = true,
	["num_div"] = true,
	["num_mul"] = true,
	["num_sub"] = true,
	["num_add"] = true,
	["num_sub"] = true,
	["escape"] = true,
	["insert"] = true,
	["home"] = true,
	["delete"] = true,
	["end"] = true,
	["pgup"] = true,
	["scroll"] = true,
	["pause"] = true,
	["ralt"] = true,
	["enter"] = true,
	["capslock"] = true,

	["arrow_l"] = true,
	["arrow_u"] = true,
	["arrow_d"] = true,
	["arrow_r"] = true,
}

szamok = {
	["0"] = true,
	["1"] = true,
	["2"] = true,
	["3"] = true,
	["4"] = true,
	["5"] = true,
	["6"] = true,
	["7"] = true,
	["8"] = true,
	["9"] = true,

	["num_0"] = true,
	["num_1"] = true,
	["num_2"] = true,
	["num_3"] = true,
	["num_4"] = true,
	["num_5"] = true,
	["num_6"] = true,
	["num_7"] = true,
	["num_8"] = true,
	["num_9"] = true,
}

kedvenc_tevekenyseg = {"Sportolás","Túrázás","Horgászat","Zenehallgatás","Autózás","Kertészkedés","Munka","Segítés az embereknek","Lövöldözés","Evés vagy Ivás","Motorozás","Hajózás","Biciklizés","Világjárás","Vásárlás"}
loading_texts = {
	"Ahhoz, hogy ne maradj le legújabb posztjainkról, KÖVESD be facebook oldalunkat! https://www.facebook.com/OriginalRoleplayOfficial",
	"Beszélgetni szeretnél? Kérdésed van? CSATLAKOZZ Discord szerverünkre! dc.originalrp.eu",
	"Szervezet tagja szeretnél lenni? Panaszt akarsz tenni egy játékosra vagy adminisztrátorra?  Fórumunkon megteheted! https://forum.originalrp.eu",
	"Támogatni szeretnéd a szervert? Minden támogatással kapcsolatos kérdésedre weboldalunkon választ kapsz! https://www.originalrp.eu",
}

ban_menus = {"Adminisztrátor", "Indok", "Kitiltás időpontja", "Kitiltás lejárata", "Serial", "Felhasználó név"}
ban_requset_menus = {"admin", "reason", "ban_date", "end_date", "serial", "username"}

saveNeededWeaponSkills = {69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79}

-- char create v2
charCreateCameraPosition = {1244.5532226562,-1478.4471435547,13.6,1245.513671875,-1478.1688232422,13.6}
charCreatePedPosition = {1250.0418701172,-1478.8286132812,13.539237976074,57}
availableStartPositions = {
	{"Érkezés repülővel", "Los Santos", {1685.5225830078, -2331.5036621094, 13.546875, 0}},
	{"Érkezés hajóval", "Red County", {-743.67333984375,222.09120178223,3.1307954788208, 32}},
}